---
kind: property
id: P:Autodesk.Revit.DB.NumberSystem.NumberDisplayRule
source: html/9b5e48cf-e0f1-5e1a-af33-4e9c3dec0b52.htm
---
# Autodesk.Revit.DB.NumberSystem.NumberDisplayRule Property

The display rule of the number system.

## Syntax (C#)
```csharp
public NumberSystemDisplayRule NumberDisplayRule { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration